/*
 * ***변수 / 데이터형
 * ***연산자 / 제어문
 * ------------
 * | 배열 / ***메소드
 * ------------
 * 문자열 / 문자열 배열
 * ------------
 * 사용자 정의 데이터형 : 클래스
 * ----------------------- + 기능 => 객체 지향 프로그램
 * 클래스 == 클래스
 * 		 | 인터페이스
 * -----------------------
 * 예외처리
 * -----------------------
 * 기타 기능
 * = 어노테이션
 * = 열거형
 * = 람다식
 * -----------------------
 * 라이브러리
 * : 컬렉션
 * : IO
 * : 네트워크
 * : 데이터베이스
 * ----------------------- 웹에서 응용 / 오라클 연동
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
