/*
 * 변수 / 배열 ==> 데이터를 저장하는 용도
 * 		  => 데이터가 많은 경우(파일, 크롤링, 오라클)
 * 		     ------------------------------- 읽기 / 검색
 * 일반변수 = 사용자가 입력할 때 저장
 * => 초기화
 * => 명시적(임의로 결정) => 0,1
 * => 입력값을 받는 경우 Scanner
 * => 난수
 * => 파일 읽기 ==> 배열
 * => 크롤링 ==> 배열
 * 
 * 루프변수 = i, j
 * 누적변수 = sum ===> sum+=i
 * 갯수변수 = count ===> count++
 * => 어떤 데이터 저장
 * 	 ------------- 데이터형
 * int, long, double, String, boolean
 *                    ------ 배열
 * 배열은 같은 유형 데이터가 3개 이상이면
 * -----+for
 * -------------데이터 저장 방법----------
 * 데이터 가공 : 연산자 / 제어문
 * 
 * 연산자
 *   증감연산자 (++, --) / 부정연산자 (!) ==> 조건문을 만들 경우
 *   ------> 1개 증가 / 1개 감소
 *   형변환 연산자 ==> double => int / 클래스 형변환
 *   ==> 자동 형변환(제네릭)
 *   
 *   산술연산자 : 통계 => 장바구니 / 결제 금액 => 단독으로 사용
 *   
 *   비교연산자 / 논리연산자 => 조건문 만들때
 *   
 */
import java.util.*;
public class 형식_사용처정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
